___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

<h1><p style="text-align: center;">Pandas Lesson, Session - 4</p><h1>

# Data Frames

 - ### ``DataFrames`` are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

 ## Creating a DataFrame using the ``list``s of data and columns

pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

Two-dimensional, size-mutable, potentially heterogeneous tabular data.

In [2]:
data = [1, 3, 5, 7, 9, 18]
data

[1, 3, 5, 7, 9, 18]

In [3]:
pd.DataFrame(data)

    0
0   1
1   3
2   5
3   7
4   9
5  18

In [4]:
pd.Series(data)

0     1
1     3
2     5
3     7
4     9
5    18
dtype: int64

In [5]:
pd.DataFrame(data, columns=['column1'])

   column1
0        1
1        3
2        5
3        7
4        9
5       18

 ## Creating a DataFrame using a ``NumPy Arrays``

In [6]:
m = np.arange(1,24,2).reshape(3,4)
m

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [7]:
df=pd.DataFrame(data=m, columns=['var1','var2','var3','var4'])
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [8]:
df.head(2)

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15

In [9]:
df.tail(2)

   var1  var2  var3  var4
1     9    11    13    15
2    17    19    21    23

In [10]:
df.sample(2)

   var1  var2  var3  var4
1     9    11    13    15
0     1     3     5     7

In [11]:
df.columns

Index(['var1', 'var2', 'var3', 'var4'], dtype='object')

In [12]:
for i in df.columns:
    print(i)

var1
var2
var3
var4

In [13]:
df.columns=['new1','new2','new3','new4']
df

   new1  new2  new3  new4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

In [14]:
df.index = ["a","b","c"]
df

   new1  new2  new3  new4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [15]:
df.rename(columns={"new1": "a", "new2": "b"})

    a   b  new3  new4
a   1   3     5     7
b   9  11    13    15
c  17  19    21    23

In [16]:
df.rename(index={"a": 1, "b": 2})

   new1  new2  new3  new4
1     1     3     5     7
2     9    11    13    15
c    17    19    21    23

In [17]:
df

   new1  new2  new3  new4
a     1     3     5     7
b     9    11    13    15
c    17    19    21    23

In [18]:
df.shape

(3, 4)

In [19]:
df.shape[1]

4

In [20]:
df.ndim

2

In [21]:
df.size

12

In [22]:
len(df)

3

In [23]:
df.values

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type(df.values)

numpy.ndarray

 ## Creating a DataFrame using a ``dict``

In [26]:
s1 = np.random.randint(2,10, size = 4)
s2 = np.random.randint(3,10, size = 4)
s3 = np.random.randint(4,15, size = 4)

In [27]:
s1

array([4, 8, 8, 3])

In [28]:
s2

array([5, 7, 5, 6])

In [29]:
s3

array([ 7, 11, 10, 14])

In [30]:
myDict= {'var1':s1,'var2':s2,'var3':s3}

In [31]:
df1 = pd.DataFrame(myDict)
df1

   var1  var2  var3
0     4     5     7
1     8     7    11
2     8     5    10
3     3     6    14

In [32]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
[i for i in df1.index]

[0, 1, 2, 3]

In [34]:
# we can check any column name whether it belongs to the DataFrame or not
"var2" in df1

True

In [35]:
'var5' in df1

False

In [36]:
df1

   var1  var2  var3
0     4     5     7
1     8     7    11
2     8     5    10
3     3     6    14

### Now, let's examine again the ***idexing, selection*** and ***slicing*** methods and several ***attributes*** using a different DataFrame

In [37]:
from numpy.random import randn

In [38]:
np.random.seed(101)
df3 = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
# creating a DataFrame by "positional arguments"
pd.DataFrame(randn(5,4), 'a b c d e'.split(), 'w x y z'.split())

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [40]:
# creating a DataFrame by "keyword arguments"
pd.DataFrame(randn(5,4),columns='w x y z'.split(), index='a b c d e'.split())

          w         x         y         z
a -0.993263  0.196800 -1.136645  0.000366
b  1.025984 -0.156598 -0.031579  0.649826
c  2.154846 -0.610259 -0.755325 -0.346419
d  0.147027 -0.479448  0.558769  1.024810
e -0.925874  1.862864 -1.133817  0.610478

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [41]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df3['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [43]:
# SQL Syntax (NOT RECOMMENDED!)
df3.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

#### DataFrame Columns are just Series

In [44]:
type(df3['Y'])

pandas.core.series.Series

In [45]:
df3[['Y']]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [46]:
type(df3[['Y']])

pandas.core.frame.DataFrame

In [47]:
# Pass a list of column names
df3[['Z','X']]

          Z         X
A  0.503826  0.628133
B  0.605965 -0.319318
C -0.589001  0.740122
D  0.955057 -0.758872
E  0.683509  1.978757

In [48]:
#df3['Z','X'] gives error

In [49]:
df3["X":"Z"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [50]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [51]:
df3['B':'D']

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [52]:
#df3['C','D'] gives error

In [53]:
df3["A":"C"][["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

**Creating a new column:**

In [54]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
df3['X*Y']=df3['X']*df3['Y']
df3

          W         X         Y         Z       X*Y
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

In [56]:
df3["T"] = [1,2,3,4,5]
df3

          W         X         Y         Z       X*Y  T
A  2.706850  0.628133  0.907969  0.503826  0.570325  1
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  2
C -2.018168  0.740122  0.528813 -0.589001  0.391387  3
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  4
E  0.190794  1.978757  2.605967  0.683509  5.156577  5

## [Removing Columns & Rows](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-drop.ipynb)

 ### Removing Columns

In [57]:
df3.drop('X*Y', axis=1)

          W         X         Y         Z  T
A  2.706850  0.628133  0.907969  0.503826  1
B  0.651118 -0.319318 -0.848077  0.605965  2
C -2.018168  0.740122  0.528813 -0.589001  3
D  0.188695 -0.758872 -0.933237  0.955057  4
E  0.190794  1.978757  2.605967  0.683509  5

In [58]:
df3

          W         X         Y         Z       X*Y  T
A  2.706850  0.628133  0.907969  0.503826  0.570325  1
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  2
C -2.018168  0.740122  0.528813 -0.589001  0.391387  3
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  4
E  0.190794  1.978757  2.605967  0.683509  5.156577  5

In [59]:
df3.drop(["X*Y", "T"], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
df3

          W         X         Y         Z       X*Y  T
A  2.706850  0.628133  0.907969  0.503826  0.570325  1
B  0.651118 -0.319318 -0.848077  0.605965  0.270806  2
C -2.018168  0.740122  0.528813 -0.589001  0.391387  3
D  0.188695 -0.758872 -0.933237  0.955057  0.708208  4
E  0.190794  1.978757  2.605967  0.683509  5.156577  5

In [61]:
df3.drop(columns = ["X*Y", "T"])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [62]:
# Not inplace unless specified!
df3.drop(["X*Y", "T"], axis=1, inplace=True)

In [63]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

 ### Removing rows

In [64]:
df3.drop('C',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
df3.drop(index=['C'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
# the default value of axis is 0 (axis = 0)
df4 = df3.drop('C', axis=0)
df4

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selecting Rows

### First, let's take a quick look at [`.loc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-loc.ipynb) | [`.iloc[]`](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-iloc.ipynb)

#### `.loc[]`  allows us to select data using **labels** (names) of rows (index) & columns

#### `.iloc[]`  allows us to select data using **index numbers** of rows (index) & columns. it's like classical indexing logic

In [69]:
m = np.random.randint(1,40, size=(8,4))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3",'var4'])
df4

   var1  var2  var3  var4
0     4    38    30    23
1    22    22    18    24
2    31    37     8    21
3    28    12     6    23
4    26    19    14    39
5     4    15    24    14
6    25    21     1    30
7    12    28    34    25

In [70]:
df4.loc[4]

var1    26
var2    19
var3    14
var4    39
Name: 4, dtype: int32

In [71]:
df4.loc[[4]]

   var1  var2  var3  var4
4    26    19    14    39

In [72]:
# Slicing produces the same type of the data. Here, DataFrame
df4.loc[2:5]

   var1  var2  var3  var4
2    31    37     8    21
3    28    12     6    23
4    26    19    14    39
5     4    15    24    14

In [73]:
df4.iloc[2:5]

   var1  var2  var3  var4
2    31    37     8    21
3    28    12     6    23
4    26    19    14    39

In [74]:
df4

   var1  var2  var3  var4
0     4    38    30    23
1    22    22    18    24
2    31    37     8    21
3    28    12     6    23
4    26    19    14    39
5     4    15    24    14
6    25    21     1    30
7    12    28    34    25

In [75]:
df4.index='a b c d e f g h'.split()
df4

   var1  var2  var3  var4
a     4    38    30    23
b    22    22    18    24
c    31    37     8    21
d    28    12     6    23
e    26    19    14    39
f     4    15    24    14
g    25    21     1    30
h    12    28    34    25

In [76]:
df4.iloc[1:4]

   var1  var2  var3  var4
b    22    22    18    24
c    31    37     8    21
d    28    12     6    23

In [77]:
#df4.loc[1:4] gives error

In [78]:
df4.loc['c':'g']

   var1  var2  var3  var4
c    31    37     8    21
d    28    12     6    23
e    26    19    14    39
f     4    15    24    14
g    25    21     1    30

In [79]:
df4

   var1  var2  var3  var4
a     4    38    30    23
b    22    22    18    24
c    31    37     8    21
d    28    12     6    23
e    26    19    14    39
f     4    15    24    14
g    25    21     1    30
h    12    28    34    25

In [80]:
df4.iloc[4,1]

19

In [81]:
df4.loc['d':'g','var3']

d     6
e    14
f    24
g     1
Name: var3, dtype: int32

In [82]:
df4.loc['d':'g']['var3']

d     6
e    14
f    24
g     1
Name: var3, dtype: int32

In [83]:
# how can we select these data as a DataFrame not a series
df4.loc['d':'g'][['var3']]

   var3
d     6
e    14
f    24
g     1

In [84]:
df4.loc['d':'g', ["var3"]]

   var3
d     6
e    14
f    24
g     1

In [85]:
df4.iloc[2:5,2]

c     8
d     6
e    14
Name: var3, dtype: int32

In [86]:
df4.iloc[2:5][['var2']]

   var2
c    37
d    12
e    19

#### Let's continue to examine `.loc[]` and `.iloc[]` using ``df3`` again

In [87]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [88]:
df3.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

Or select based off of position instead of label

In [89]:
df3.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [90]:
# returns as a DataFrame
df3.loc[['C']]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [91]:
# returns as a DataFrame
df3.iloc[[2]]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [92]:
# Well, how can we select entire column "Y" using ".iloc[]"
df3.iloc[:,2]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [93]:
df3.iloc[:,[2]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [94]:
df3[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
C  0.528813  0.740122
D -0.933237 -0.758872
E  2.605967  1.978757

### Selecting subset of rows and columns

 - ### `.loc[[row labels|names], [column labels|names]]`

 - ### `.iloc[[row index numbers], [column index numbers]]`

In [95]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df3.loc['C','Z']

-0.5890005332865824

In [97]:
# let's select the same data as a DataFrame
df3.loc[['C'],['Z']]

          Z
C -0.589001

In [98]:
df3.loc[['A','C'],['W','Z']]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

In [99]:
df3.iloc[[0,2],[0,3]]

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [100]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
# returns a DataFrame consists of bool type
df3>0.5

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D  False  False  False   True
E  False   True   True   True

In [102]:
df3[df3>0.5]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D       NaN       NaN       NaN  0.955057
E       NaN  1.978757  2.605967  0.683509

In [103]:
# It returns based on rows.
df3[df3['Z']>0.5]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [104]:
df3[['Z']]

          Z
A  0.503826
B  0.605965
C -0.589001
D  0.955057
E  0.683509

In [105]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df3[df3['X']<1]['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
Name: W, dtype: float64

In [107]:
# how can we select the data as a DataFrame

In [108]:
df3[df3['X']<1][['W']]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695

In [109]:
df3[df3['Y']>0][['Z','W','Y']]

          Z         W         Y
A  0.503826  2.706850  0.907969
C -0.589001 -2.018168  0.528813
E  0.683509  0.190794  2.605967

#### For two conditions you can use **|**  `or`,  **&**   `and` with parenthesis:

In [110]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [111]:
df3[(df3['W']>0) & (df3['Y']<1)] = 0

In [112]:
df3

          W         X         Y         Z
A  0.000000  0.000000  0.000000  0.000000
B  0.000000  0.000000  0.000000  0.000000
C -2.018168  0.740122  0.528813 -0.589001
D  0.000000  0.000000  0.000000  0.000000
E  0.190794  1.978757  2.605967  0.683509

### Conditional selection using ``.loc[]`` and ``.iloc[]``

In [113]:
df3.loc[(df3.X>0), ['X','Z']]

          X         Z
C  0.740122 -0.589001
E  1.978757  0.683509

In [114]:
df3.loc[((df3.W>1) | (df3.Y<1)), ['Y','Z']]

          Y         Z
A  0.000000  0.000000
B  0.000000  0.000000
C  0.528813 -0.589001
D  0.000000  0.000000

In [115]:
df3.loc[((df3.W>1) | (df3.Y<1)), ['Y','Z']] = 1

In [116]:
df3

          W         X         Y         Z
A  0.000000  0.000000  1.000000  1.000000
B  0.000000  0.000000  1.000000  1.000000
C -2.018168  0.740122  1.000000  1.000000
D  0.000000  0.000000  1.000000  1.000000
E  0.190794  1.978757  2.605967  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [117]:
df3

          W         X         Y         Z
A  0.000000  0.000000  1.000000  1.000000
B  0.000000  0.000000  1.000000  1.000000
C -2.018168  0.740122  1.000000  1.000000
D  0.000000  0.000000  1.000000  1.000000
E  0.190794  1.978757  2.605967  0.683509

In [118]:
# Reset to default 0,1...n index
df3.reset_index()

  index         W         X         Y         Z
0     A  0.000000  0.000000  1.000000  1.000000
1     B  0.000000  0.000000  1.000000  1.000000
2     C -2.018168  0.740122  1.000000  1.000000
3     D  0.000000  0.000000  1.000000  1.000000
4     E  0.190794  1.978757  2.605967  0.683509

In [119]:
df3

          W         X         Y         Z
A  0.000000  0.000000  1.000000  1.000000
B  0.000000  0.000000  1.000000  1.000000
C -2.018168  0.740122  1.000000  1.000000
D  0.000000  0.000000  1.000000  1.000000
E  0.190794  1.978757  2.605967  0.683509

In [120]:
df3.reset_index(drop=True)

          W         X         Y         Z
0  0.000000  0.000000  1.000000  1.000000
1  0.000000  0.000000  1.000000  1.000000
2 -2.018168  0.740122  1.000000  1.000000
3  0.000000  0.000000  1.000000  1.000000
4  0.190794  1.978757  2.605967  0.683509

In [121]:
df3

          W         X         Y         Z
A  0.000000  0.000000  1.000000  1.000000
B  0.000000  0.000000  1.000000  1.000000
C -2.018168  0.740122  1.000000  1.000000
D  0.000000  0.000000  1.000000  1.000000
E  0.190794  1.978757  2.605967  0.683509

In [122]:
newindx='CA NY WY OR CO'.split()
newindx

['CA', 'NY', 'WY', 'OR', 'CO']

In [123]:
df3['newidx']=newindx

In [124]:
df3

          W         X         Y         Z newidx
A  0.000000  0.000000  1.000000  1.000000     CA
B  0.000000  0.000000  1.000000  1.000000     NY
C -2.018168  0.740122  1.000000  1.000000     WY
D  0.000000  0.000000  1.000000  1.000000     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [125]:
df3.set_index('newidx')

               W         X         Y         Z
newidx
CA      0.000000  0.000000  1.000000  1.000000
NY      0.000000  0.000000  1.000000  1.000000
WY     -2.018168  0.740122  1.000000  1.000000
OR      0.000000  0.000000  1.000000  1.000000
CO      0.190794  1.978757  2.605967  0.683509

In [126]:
df3

          W         X         Y         Z newidx
A  0.000000  0.000000  1.000000  1.000000     CA
B  0.000000  0.000000  1.000000  1.000000     NY
C -2.018168  0.740122  1.000000  1.000000     WY
D  0.000000  0.000000  1.000000  1.000000     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [127]:
df3.set_index('newidx',inplace=True)

In [128]:
df3

               W         X         Y         Z
newidx
CA      0.000000  0.000000  1.000000  1.000000
NY      0.000000  0.000000  1.000000  1.000000
WY     -2.018168  0.740122  1.000000  1.000000
OR      0.000000  0.000000  1.000000  1.000000
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [129]:
# Index Levels
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2','M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]
multi_index = list(zip(outside, inside))
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

In [130]:
hier_index=pd.MultiIndex.from_tuples(multi_index)

In [131]:
hier_index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

In [132]:
df=pd.DataFrame(np.random.randn(9,4), index = hier_index, columns=['A','B','C','D'])
df

             A         B         C         D
M1 1 -0.758436 -0.454696  1.297617 -0.825378
   2  0.251915  0.518763  0.587968 -0.148194
   3 -0.876702  0.792750  0.539118  0.669774
M2 1 -1.270484 -0.446181  0.779475  0.479900
   2 -0.960697 -2.002399 -1.263599 -0.696232
   3 -1.148220  1.607435 -1.226870  1.405532
M3 5 -1.137201 -0.535478  2.142717  1.691452
   6  0.275225 -0.852057  0.298659 -0.565370
   7  0.358325  0.699676  0.417366 -0.238049

Now let's show how to index this! For index hierarchy we use ``df.loc[]``, if this was on the columns axis, you would just use normal bracket notation ``df[]``. Calling one level of the index returns the sub-dataframe:

In [133]:
df.loc['M1']

          A         B         C         D
1 -0.758436 -0.454696  1.297617 -0.825378
2  0.251915  0.518763  0.587968 -0.148194
3 -0.876702  0.792750  0.539118  0.669774

In [137]:
df.loc['M1'].loc[2]

A    0.251915
B    0.518763
C    0.587968
D   -0.148194
Name: 2, dtype: float64

In [135]:
df.loc['M1'].loc[[2]]

          A         B         C         D
2  0.251915  0.518763  0.587968 -0.148194

In [136]:
df.index.names

FrozenList([None, None])

In [137]:
df.index.names = ['Group','Num']

In [138]:
df

                  A         B         C         D
Group Num
M1    1   -0.758436 -0.454696  1.297617 -0.825378
      2    0.251915  0.518763  0.587968 -0.148194
      3   -0.876702  0.792750  0.539118  0.669774
M2    1   -1.270484 -0.446181  0.779475  0.479900
      2   -0.960697 -2.002399 -1.263599 -0.696232
      3   -1.148220  1.607435 -1.226870  1.405532
M3    5   -1.137201 -0.535478  2.142717  1.691452
      6    0.275225 -0.852057  0.298659 -0.565370
      7    0.358325  0.699676  0.417366 -0.238049

### let's take a quick look at the [``.xs()``](http://localhost:8888/notebooks/pythonic/DAwPythonSessions/w3resource-pandas-dataframe-xs.ipynb)

DataFrame.xs(key, axis=0, level=None, drop_level=True)

Return cross-section from the Series/DataFrame.

This method takes a key argument to select data at a particular level of a MultiIndex.

In [139]:
df.xs('M1')

            A         B         C         D
Num
1   -0.758436 -0.454696  1.297617 -0.825378
2    0.251915  0.518763  0.587968 -0.148194
3   -0.876702  0.792750  0.539118  0.669774

In [140]:
df.loc['M1']

            A         B         C         D
Num
1   -0.758436 -0.454696  1.297617 -0.825378
2    0.251915  0.518763  0.587968 -0.148194
3   -0.876702  0.792750  0.539118  0.669774

In [141]:
df.xs(['M1',2])

A    0.251915
B    0.518763
C    0.587968
D   -0.148194
Name: (M1, 2), dtype: float64

In [142]:
df.xs(('M1',2))

A    0.251915
B    0.518763
C    0.587968
D   -0.148194
Name: (M1, 2), dtype: float64

In [143]:
df.xs(('M1',2), level=[0,1])

                  A         B         C         D
Group Num
M1    2    0.251915  0.518763  0.587968 -0.148194

In [144]:
df.xs(('M1',2), level=["Group","Num"])

                  A         B         C         D
Group Num
M1    2    0.251915  0.518763  0.587968 -0.148194

In [145]:
#df.loc[2] #gives an error
#df.xs(2) #gives an error
df.xs(2, level = 'Num')

              A         B         C         D
Group
M1     0.251915  0.518763  0.587968 -0.148194
M2    -0.960697 -2.002399 -1.263599 -0.696232

In [146]:
df.xs(5, level = 'Num')

              A         B         C         D
Group
M3    -1.137201 -0.535478  2.142717  1.691452

In [147]:
df.xs(5, level = 1)

              A         B         C         D
Group
M3    -1.137201 -0.535478  2.142717  1.691452

In [148]:
df.xs('C', axis=1)

Group  Num
M1     1      1.297617
       2      0.587968
       3      0.539118
M2     1      0.779475
       2     -1.263599
       3     -1.226870
M3     5      2.142717
       6      0.298659
       7      0.417366
Name: C, dtype: float64

### Let's learn new functions/attributes/methods on "iris dataset"

In [149]:
import seaborn as sns

In [150]:
df=sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [151]:
df.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [152]:
df.shape

(150, 5)

In [153]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [154]:
df.sample(4)

     sepal_length  sepal_width  petal_length  petal_width     species
2             4.7          3.2           1.3          0.2      setosa
100           6.3          3.3           6.0          2.5   virginica
89            5.5          2.5           4.0          1.3  versicolor
125           7.2          3.2           6.0          1.8   virginica

In [155]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [158]:
# df.describe().T
df.describe().transpose()

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [156]:
df.describe(include="all") # "number" and "object" can be used as include/exclude parameter

        sepal_length  sepal_width  petal_length  petal_width    species
count     150.000000   150.000000    150.000000   150.000000        150
unique           NaN          NaN           NaN          NaN          3
top              NaN          NaN           NaN          NaN  virginica
freq             NaN          NaN           NaN          NaN         50
mean        5.843333     3.057333      3.758000     1.199333        NaN
std         0.828066     0.435866      1.765298     0.762238        NaN
min         4.300000     2.000000      1.000000     0.100000        NaN
25%         5.100000     2.800000      1.600000     0.300000        NaN
50%         5.800000     3.000000      4.350000     1.300000        NaN
75%         6.400000     3.300000      5.100000     1.800000        NaN
max         7.900000     4.400000      6.900000     2.500000        NaN

In [161]:
df.corr()

              sepal_length  sepal_width  petal_length  petal_width
sepal_length      1.000000    -0.117570      0.871754     0.817941
sepal_width      -0.117570     1.000000     -0.428440    -0.366126
petal_length      0.871754    -0.428440      1.000000     0.962865
petal_width       0.817941    -0.366126      0.962865     1.000000

In [162]:
df.corr()[["sepal_length"]]

              sepal_length
sepal_length      1.000000
sepal_width      -0.117570
petal_length      0.871754
petal_width       0.817941

In [163]:
df['petal_length'].corr(df["petal_width"])

0.9628654314027963

In [157]:
df.species.value_counts(dropna=False)

virginica     50
setosa        50
versicolor    50
Name: species, dtype: int64

In [160]:
df['species'].value_counts(dropna = False, normalize = True)

versicolor    0.333333
setosa        0.333333
virginica     0.333333
Name: species, dtype: float64

In [158]:
df.mean()

sepal_length    5.843333
sepal_width     3.057333
petal_length    3.758000
petal_width     1.199333
dtype: float64

In [159]:
df.sum(axis=0)

sepal_length                                                876.5
sepal_width                                                 458.6
petal_length                                                563.7
petal_width                                                 179.9
species         setosasetosasetosasetosasetosasetosasetosaseto...
dtype: object

In [160]:
df.sum(axis=1)

0      10.2
1       9.5
2       9.4
3       9.4
4      10.2
       ...
145    17.2
146    15.7
147    16.7
148    17.3
149    15.8
Length: 150, dtype: float64

In [161]:
df.sepal_length.sum()

876.5

In [162]:
df.species.unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [163]:
df.species.nunique()

3

In [164]:
df.loc[df["species"] == "setosa", "sepal_length"]

0     5.1
1     4.9
2     4.7
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.1
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    4.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    4.9
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.3
49    5.0
Name: sepal_length, dtype: float64

In [166]:
df[(df.sepal_length>4) & (df.sepal_length<5)]

     sepal_length  sepal_width  petal_length  petal_width     species
1             4.9          3.0           1.4          0.2      setosa
2             4.7          3.2           1.3          0.2      setosa
3             4.6          3.1           1.5          0.2      setosa
6             4.6          3.4           1.4          0.3      setosa
8             4.4          2.9           1.4          0.2      setosa
9             4.9          3.1           1.5          0.1      setosa
11            4.8          3.4           1.6          0.2      setosa
12            4.8          3.0           1.4          0.1      setosa
13            4.3          3.0           1.1          0.1      setosa
22            4.6          3.6           1.0          0.2      setosa
24            4.8          3.4           1.9          0.2      setosa
29            4.7          3.2           1.6          0.2      setosa
30            4.8          3.1           1.6          0.2      setosa
34            4.9          3.1           1.5          0.2      setosa
37            4.9          3.6           1.4          0.1      setosa
38            4.4          3.0           1.3          0.2      setosa
41            4.5          2.3           1.3          0.3      setosa
42            4.4          3.2           1.3          0.2      setosa
45            4.8          3.0           1.4          0.3      setosa
47            4.6          3.2           1.4          0.2      setosa
57            4.9          2.4           3.3          1.0  versicolor
106           4.9          2.5           4.5          1.7   virginica

In [167]:
df[(df.species == "virginica") & (df.sepal_length>4)  & (df.sepal_length<5)]

     sepal_length  sepal_width  petal_length  petal_width    species
106           4.9          2.5           4.5          1.7  virginica

In [168]:
df.sort_values(by = 'sepal_length', ascending = True)

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

# End of the Session